In [1]:
import pandas as pd

In [2]:
s = pd.Series([1, 2, 3, 4, 5],
index = ['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
s['a']

1

In [4]:
import numpy as np

In [5]:
li = [1, 2, 3, 4, 5]

In [6]:
type(li)

list

In [10]:
x= np.array(li)

In [11]:
x

array([1, 2, 3, 4, 5])

In [12]:
type(x)

numpy.ndarray

In [13]:
np.array([1,2,3,4,'hi'])

array(['1', '2', '3', '4', 'hi'], dtype='<U11')

In [14]:
list(range(9))

[0, 1, 2, 3, 4, 5, 6, 7, 8]

In [20]:
np.arange(90).reshape(30,3)

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14],
       [15, 16, 17],
       [18, 19, 20],
       [21, 22, 23],
       [24, 25, 26],
       [27, 28, 29],
       [30, 31, 32],
       [33, 34, 35],
       [36, 37, 38],
       [39, 40, 41],
       [42, 43, 44],
       [45, 46, 47],
       [48, 49, 50],
       [51, 52, 53],
       [54, 55, 56],
       [57, 58, 59],
       [60, 61, 62],
       [63, 64, 65],
       [66, 67, 68],
       [69, 70, 71],
       [72, 73, 74],
       [75, 76, 77],
       [78, 79, 80],
       [81, 82, 83],
       [84, 85, 86],
       [87, 88, 89]])

In [21]:
import numpy as np
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=['a','b','c','d'],
                  columns=['Alok','Kishore','Anuj','Ankit'])

In [22]:
df

   Alok  Kishore  Anuj  Ankit
a     0        1     2      3
b     4        5     6      7
c     8        9    10     11
d    12       13    14     15

In [24]:
names = ['Alok','Anuj','Kishore','Ankit']
df.reindex(columns= names)

   Alok  Anuj  Kishore  Ankit
a     0     2        1      3
b     4     6        5      7
c     8    10        9     11
d    12    14       13     15

In [25]:
df

   Alok  Kishore  Anuj  Ankit
a     0        1     2      3
b     4        5     6      7
c     8        9    10     11
d    12       13    14     15

In [26]:
df.loc[['c','d','a']]

   Alok  Kishore  Anuj  Ankit
c     8        9    10     11
d    12       13    14     15
a     0        1     2      3

In [28]:
df.drop('a')

   Alok  Kishore  Anuj  Ankit
b     4        5     6      7
c     8        9    10     11
d    12       13    14     15

In [30]:
df.drop(['a','b'])

   Alok  Kishore  Anuj  Ankit
c     8        9    10     11
d    12       13    14     15

In [31]:
df

   Alok  Kishore  Anuj  Ankit
a     0        1     2      3
b     4        5     6      7
c     8        9    10     11
d    12       13    14     15

In [34]:
df.drop('Ankit',axis = 1)

   Alok  Kishore  Anuj
a     0        1     2
b     4        5     6
c     8        9    10
d    12       13    14

In [35]:
df.drop(['Anuj','Ankit','Kishore'],axis=1)

   Alok
a     0
b     4
c     8
d    12

In [36]:
df

   Alok  Kishore  Anuj  Ankit
a     0        1     2      3
b     4        5     6      7
c     8        9    10     11
d    12       13    14     15

In [38]:
df.describe()

            Alok    Kishore       Anuj      Ankit
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [39]:
df.mean()

Alok       6.0
Kishore    7.0
Anuj       8.0
Ankit      9.0
dtype: float64

In [40]:
df.mean(1)

a     1.5
b     5.5
c     9.5
d    13.5
dtype: float64

In [41]:
df.mean(0)

Alok       6.0
Kishore    7.0
Anuj       8.0
Ankit      9.0
dtype: float64

# Arithmetic Operations in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.arange(4),
              index=['a','b','d','e'])
s2 = pd.Series(np.arange(5),
              index=['a','c','e','g','h'])

In [3]:
s1
s2

a    0
c    1
e    2
g    3
h    4
dtype: int32

In [4]:
s1

a    0
b    1
d    2
e    3
dtype: int32

In [5]:
s2

a    0
c    1
e    2
g    3
h    4
dtype: int32

In [6]:
s3 = s1+s2

In [7]:
s3

a    0.0
b    NaN
c    NaN
d    NaN
e    5.0
g    NaN
h    NaN
dtype: float64

In [8]:
import numpy as np

In [32]:
df1=pd.DataFrame(
    np.arange(9,18).reshape(3,3),
    columns=list("XYZ"),
    index=["Alok","Anuj","Kishore"])
df2=pd.DataFrame(
    np.arange(6,12).reshape(2,3),
    columns=list("ZYX"),
    index=["Alok","Ankit"])

In [33]:
print(df1)

          X   Y   Z
Alok      9  10  11
Anuj     12  13  14
Kishore  15  16  17

In [34]:
print(df2)

       Z   Y   X
Alok   6   7   8
Ankit  9  10  11

In [35]:
df1+df2

            X     Y     Z
Alok     17.0  17.0  17.0
Ankit     NaN   NaN   NaN
Anuj      NaN   NaN   NaN
Kishore   NaN   NaN   NaN

In [36]:
fd1= pd.DataFrame(np.arange(1001,1010),
                 columns=list[])

SyntaxError: invalid syntax. Perhaps you forgot a comma? (662546123.py, line 2)

In [37]:
df1.add()

TypeError: flex_arith_method_FRAME.<locals>.f() missing 1 required positional argument: 'other'

In [45]:
df4 = df1.add(df2,fill_value = 0)

In [46]:
df4.add(df2,fill_value = 0, implace = True)

TypeError: flex_arith_method_FRAME.<locals>.f() got an unexpected keyword argument 'implace'

In [41]:
df3 = df1+df2

In [42]:
df3

            X     Y     Z
Alok     17.0  17.0  17.0
Ankit     NaN   NaN   NaN
Anuj      NaN   NaN   NaN
Kishore   NaN   NaN   NaN

In [47]:
df4

            X     Y     Z
Alok     17.0  17.0  17.0
Ankit    11.0  10.0   9.0
Anuj     12.0  13.0  14.0
Kishore  15.0  16.0  17.0

In [48]:
1/df4

                X         Y         Z
Alok     0.058824  0.058824  0.058824
Ankit    0.090909  0.100000  0.111111
Anuj     0.083333  0.076923  0.071429
Kishore  0.066667  0.062500  0.058824

In [49]:
df4*2

            X     Y     Z
Alok     34.0  34.0  34.0
Ankit    22.0  20.0  18.0
Anuj     24.0  26.0  28.0
Kishore  30.0  32.0  34.0

In [51]:
df4.mul(3)

            X     Y     Z
Alok     51.0  51.0  51.0
Ankit    33.0  30.0  27.0
Anuj     36.0  39.0  42.0
Kishore  45.0  48.0  51.0

In [52]:
df4.add(4)

            X     Y     Z
Alok     21.0  21.0  21.0
Ankit    15.0  14.0  13.0
Anuj     16.0  17.0  18.0
Kishore  19.0  20.0  21.0

# Sorting & Ranking in Pandas

In [53]:
import pandas as pd
import numpy as np

In [55]:
s = pd.Series(range(5),
             index = ['e','f','t','h','r'])
s

e    0
f    1
t    2
h    3
r    4
dtype: int64

In [56]:
s.sort_index()

e    0
f    1
h    3
r    4
t    2
dtype: int64

In [57]:
df = pd.DataFrame(
       np.arange(12).reshape(3,4),
    index=['two','three','five'],
     columns=['a','d','b','c'])
df

       a  d   b   c
two    0  1   2   3
three  4  5   6   7
five   8  9  10  11

In [58]:
df.sort_index()

       a  d   b   c
five   8  9  10  11
three  4  5   6   7
two    0  1   2   3

In [59]:
df.sort_index(axis=1)

       a   b   c  d
two    0   2   3  1
three  4   6   7  5
five   8  10  11  9

In [60]:
df.sort_index(axis=1, ascending=False)

       d   c   b  a
two    1   3   2  0
three  5   7   6  4
five   9  11  10  8

In [61]:
s2.sort_values()

a    0
c    1
e    2
g    3
h    4
dtype: int32

In [62]:
df2 = pd.DataFrame(
    {'a':[7,18,-4,3], 'b':[5,34,65,1]})
df2

    a   b
0   7   5
1  18  34
2  -4  65
3   3   1

In [63]:
df2.sort_values(by = 'b')

    a   b
3   3   1
0   7   5
1  18  34
2  -4  65

In [66]:
df.sort_values(by ='a')

       a  d   b   c
two    0  1   2   3
three  4  5   6   7
five   8  9  10  11

In [67]:
df2.sort_values(by = 'a')

    a   b
2  -4  65
3   3   1
0   7   5
1  18  34

In [69]:
df2.sort_index

<bound method DataFrame.sort_index of     a   b
0   7   5
1  18  34
2  -4  65
3   3   1>

# Practice

In [70]:
df = pd.read_csv('cardekho_dataset.csv')

In [71]:
df

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15406,19537,Hyundai i10,Hyundai,i10,9,10723,Dealer,Petrol,Manual,19.81,1086,68.05,5,250000
15407,19540,Maruti Ertiga,Maruti,Ertiga,2,18000,Dealer,Petrol,Manual,17.50,1373,91.10,7,925000
15408,19541,Skoda Rapid,Skoda,Rapid,6,67000,Dealer,Diesel,Manual,21.14,1498,103.52,5,425000
15409,19542,Mahindra XUV500,Mahindra,XUV500,5,3800000,Dealer,Diesel,Manual,16.00,2179,140.00,7,1225000
15410,19543,Honda City,Honda,City,2,13000,Dealer,Petrol,Automatic,18.00,1497,117.60,5,1200000

In [73]:
df.describe()

,Unnamed: 0,vehicle_age,km_driven,mileage,engine,max_power,seats,selling_price
count,15411.000000,15411.000000,1.541100e+04,15411.000000,15411.000000,15411.000000,15411.000000,1.541100e+04
mean,9811.857699,6.036338,5.561648e+04,19.701151,1486.057751,100.588254,5.325482,7.749711e+05
std,5643.418542,3.013291,5.161855e+04,4.171265,521.106696,42.972979,0.807628,8.941284e+05
min,0.000000,0.000000,1.000000e+02,4.000000,793.000000,38.400000,0.000000,4.000000e+04
25%,4906.500000,4.000000,3.000000e+04,17.000000,1197.000000,74.000000,5.000000,3.850000e+05
50%,9872.000000,6.000000,5.000000e+04,19.670000,1248.000000,88.500000,5.000000,5.560000e+05
75%,14668.500000,8.000000,7.000000e+04,22.700000,1582.000000,117.300000,5.000000,8.250000e+05
max,19543.000000,29.000000,3.800000e+06,33.540000,6592.000000,626.000000,9.000000,3.950000e+07

In [74]:
df.brand.describe()

count      15411
unique        32
top       Maruti
freq        4992
Name: brand, dtype: object

In [75]:
df.vehicle_age.describe()

count    15411.000000
mean         6.036338
std          3.013291
min          0.000000
25%          4.000000
50%          6.000000
75%          8.000000
max         29.000000
Name: vehicle_age, dtype: float64

In [76]:
df.km_driven.describe()

count    1.541100e+04
mean     5.561648e+04
std      5.161855e+04
min      1.000000e+02
25%      3.000000e+04
50%      5.000000e+04
75%      7.000000e+04
max      3.800000e+06
Name: km_driven, dtype: float64

In [77]:
df.fuel_type.describe()

count      15411
unique         5
top       Petrol
freq        7643
Name: fuel_type, dtype: object

In [78]:
df.fuel_type.value_counts()

fuel_type
Petrol      7643
Diesel      7419
CNG          301
LPG           44
Electric       4
Name: count, dtype: int64

In [82]:
df.car_name.unique()

array(['Maruti Alto', 'Hyundai Grand', 'Hyundai i20', 'Ford Ecosport',
       'Maruti Wagon R', 'Hyundai i10', 'Hyundai Venue', 'Maruti Swift',
       'Hyundai Verna', 'Renault Duster', 'Mini Cooper', 'Maruti Ciaz',
       'Mercedes-Benz C-Class', 'Toyota Innova', 'Maruti Baleno',
       'Maruti Swift Dzire', 'Volkswagen Vento', 'Hyundai Creta',
       'Honda City', 'Mahindra Bolero', 'Toyota Fortuner', 'Renault KWID',
       'Honda Amaze', 'Hyundai Santro', 'Mahindra XUV500',
       'Mahindra KUV100', 'Maruti Ignis', 'Datsun RediGO',
       'Mahindra Scorpio', 'Mahindra Marazzo', 'Ford Aspire', 'Ford Figo',
       'Maruti Vitara', 'Tata Tiago', 'Volkswagen Polo', 'Kia Seltos',
       'Maruti Celerio', 'Datsun GO', 'BMW 5', 'Honda CR-V',
       'Ford Endeavour', 'Mahindra KUV', 'Honda Jazz', 'BMW 3', 'Audi A4',
       'Tata Tigor', 'Maruti Ertiga', 'Tata Safari', 'Mahindra Thar',
       'Tata Hexa', 'Land Rover Rover', 'Maruti Eeco', 'Audi A6',
       'Mercedes-Benz E-Class', 'Audi Q7', 'BMW Z4', 'BMW 6', 'Jaguar XF',
       'BMW X5', 'MG Hector', 'Honda Civic', 'Isuzu D-Max',
       'Porsche Cayenne', 'BMW X1', 'Skoda Rapid', 'Ford Freestyle',
       'Skoda Superb', 'Tata Nexon', 'Mahindra XUV300',
       'Maruti Dzire VXI', 'Volvo S90', 'Honda WR-V', 'Maruti XL6',
       'Renault Triber', 'Lexus ES', 'Jeep Wrangler', 'Toyota Camry',
       'Hyundai Elantra', 'Toyota Yaris', 'Mercedes-Benz GL-Class',
       'BMW 7', 'Maruti S-Presso', 'Maruti Dzire LXI', 'Hyundai Aura',
       'Volvo XC', 'Maserati Ghibli', 'Bentley Continental', 'Honda CR',
       'Nissan Kicks', 'Mercedes-Benz S-Class', 'Hyundai Tucson',
       'Tata Harrier', 'BMW X3', 'Skoda Octavia', 'Jeep Compass',
       'Mercedes-Benz CLS', 'Datsun redi-GO', 'Toyota Glanza',
       'Porsche Macan', 'BMW X4', 'Maruti Dzire ZXI', 'Volvo XC90',
       'Jaguar F-PACE', 'Audi A8', 'ISUZU MUX', 'Ferrari GTC4Lusso',
       'Mercedes-Benz GLS', 'Nissan X-Trail', 'Jaguar XE', 'Volvo XC60',
       'Porsche Panamera', 'Mahindra Alturas', 'Tata Altroz', 'Lexus NX',
       'Kia Carnival', 'Mercedes-AMG C', 'Lexus RX', 'Rolls-Royce Ghost',
       'Maserati Quattroporte', 'Isuzu MUX', 'Force Gurkha'], dtype=object)